asr_instructions_my = [
    "ကျေးဇူးပြု၍ ဖော်ပြပါ။",
    "အသံကိုအသိအမှတ်ပြု၍ စကားစီစဉ်လိုက်ပါ။",
    "အသံကို စကားလုံးစဉ်အတိုင်း ပြောင်းလဲပေးနိုင်ပါသလား?",
    "ကျေးဇူးပြု၍ ဒီအသံကို စာသားအဖြစ် ပြောင်းလဲပေးပါ။",
    "ဖော်ပြပါ။",  ## updated asr prompt1
    "အသံကို စကားစီစဉ်လိုက်ပါ။",
    "ကျေးဇူးပြု၍ ဒီအသံကို ဖော်ပြပါ။",
    "ပြောကြားသောစကားကို စာလုံးပေါင်းပုံဖော်ပါ။",
    "ဒီအသံကို စာသားအဖြစ် ပြောင်းလဲပေးပါ။",
    "ပြောကြားသောစကားများကို စာရေးအဖြစ် ပြောင်းလဲပေးပါ။",
    "ကျေးဇူးပြု၍ ဒီအသံ၏ စာလုံးစီစဉ်ကို ပေးပါ။",
    "အသံကို စာသားဖော်ပြမှုအဖြစ် ပြောင်းလဲပေးပါ။",
    "ကျေးဇူးပြု၍ အသံကို စာသားအဖြစ် ပြောင်းပေးပါ။",
    "အသံကို ကြားပြီး စာလုံးပေါင်းပုံစံ ပေးပါ။",
    "အသံကို စာသားအဖြစ် ပြောင်းပေးပါ။",
    "ပြောဆိုခြင်းကို စာသားအဖြစ် ပြောင်းပေးပါ။",
]

ac_instructions_my = [
    "ကျေးဇူးပြု၍ အသံအတွက် ဖော်ပြချက်များ ရေးပေးနိုင်ပါသလား?",
    "အသံအတွက် ဖော်ပြချက်များ ဖန်တီးပေးပါ။",
    "ကျွန်တော်/ကျွန်မ အသံအတွက် ဖော်ပြချက်များ ဖန်တီးပေးရန် မျှော်လင့်ပါတယ်။",
    "ကျေးဇူးပြု၍ အသံအတွက် ဖော်ပြချက်များ ဖန်တီးပေးပါ။",
    "အသံအတွက် ဖော်ပြချက်များ ပေးပါ။",
]

no_punctuation_instructions_my = [
    "ဝေါဟာရအဆုံးအဖွဲ့များ မထည့်ပါနဲ့",
    "အဆုံးအဖွဲ့များ မထည့်ဘဲ ဖြေပါ",
    "ပုဒ်ဖြတ်အမှတ်အသား မပါအောင် ပြန်ပြပါ",
]

uppercase_instructions_my = [
    "စာလုံးအားလုံးကို အကြီးစာဖြင့် ထုတ်ပြပါ",
    "အကြီးစာလုံးများဖြင့် ပြန်ပါ",
    "စာသားအားလုံးကို အကြီးစာဖြင့် ပြောင်းပေးပါ",
    "စာလုံးအားလုံးကို အကြီးစာဖြင့်ပေးပါနော်",
]

lowercase_instructions_my = [
    "စာလုံးအားလုံးကို အငယ်စာဖြင့် ထုတ်ပြပါ",
    "စာလုံးအသေးများဖြင့် ပြန်ပါ",
]
