asr_instructions_zh = [
    "请转录。",
    "你能帮我识别语音并逐字转录吗？",
    "你能把这段语音转换成文字稿吗？",
    "请将这段音频的内容转录为文本格式。",
    "转录。",
    "转录这段语音。",
    "请转录这段语音。",
    "将说出的内容记录为文字。",
    "将这段语音转换为文本格式。",
    "将说出的话转录为书面形式。",
    "请给我这段语音内容的文字转录。",
    "将语音转化为文字稿。",
    "请帮我把这段语音转录成文字。",
    "听这段语音并提供文字版本。",
    "将语音转换成文字文档作为转录。",
    "识别语音中的口头内容并将其转录为文字。",
    "处理语音并提供文字输出。",
    "将口头对话转录为书面文字。",
]

ac_instructions_zh = [
    "你能为音频生成字幕吗？",
    "请为音频生成字幕。",
    "我请求你为音频生成字幕。",
    "请您为音频创建字幕。",
    "请提供音频的字幕。",
]

no_punctuation_instructions_zh = [
    "生成时不要加标点符号",
    "不要添加标点符号",
    "返回时不带标点符号",
]

uppercase_instructions_zh = [
    "全部输出为大写字母",
    "返回大写字母的文本",
    "把所有文字变成大写字母",
    "请把所有内容用大写字母表示",
]

lowercase_instructions_zh = [
    "全部输出为小写字母",
    "返回小写字母的文本",
]
