asr_instructions_ja = [
    "文字起こししてください。",
    "音声を認識して、一語一語文字起こししてもらえますか？",
    "この音声をテキストの書き起こしに変換してもらえますか？",
    "この音声の内容をテキスト形式に文字起こししてください。",
    "文字起こししてください。",  ## updated asr prompt1
    "音声を文字起こししてください。",
    "この音声を文字起こししてください。",
    "発言内容をテキスト形式で記録してください。",
    "この音声をテキスト形式に変換してください。",
    "発言された言葉を文章に書き起こしてください。",
    "この音声の書き起こしを提供してください。",
    "音声をテキストに変換してください。",
    "音声をテキストバージョンとして提供してください。",
    "音声を文字起こししてテキストドキュメントに変換してください。",
    "音声の発話内容を認識してテキストに変換してください。",
    "音声を処理してテキストとして出力してください。",
    "会話を文字起こししてテキストにしてください。",
]

ac_instructions_ja = [
    "音声にキャプションを作成していただけますか？",
    "音声にキャプションを作成してください。",
    "音声のキャプションを生成してください。",
    "音声のキャプションを作成してください。",
    "音声のキャプションを提供してください。",
]

no_punctuation_instructions_ja = [
    "句読点を付けずに生成してください",
    "句読点を追加しないでください",
    "句読点なしで返してください",
]

uppercase_instructions_ja = [
    "すべて大文字で出力してください",
    "大文字で返してください",
    "すべての文字を大文字にしてください",
    "すべて大文字でお願いします",
]

lowercase_instructions_ja = [
    "すべて小文字で出力してください",
    "小文字で返してください",
]
