asr_instructions_ko = [
    "텍스트로 변환해 주세요.",
    "음성을 인식하여 단어별로 텍스트로 변환해 주시겠어요?",
    "음성을 텍스트로 변환해 주세요.",
    "이 오디오의 내용을 텍스트 형식으로 변환해 주세요.",
    "변환해 주세요.",  ## updated asr prompt1
    "음성을 텍스트로 변환해 주세요.",
    "이 음성을 텍스트로 변환해 주세요.",
    "말한 내용을 텍스트 형태로 기록해 주세요.",
    "이 음성을 텍스트 형식으로 변환해 주세요.",
    "음성 내용을 텍스트로 변환해 주세요.",
    "음성 내용을 텍스트로 적어 주세요.",
    "음성을 텍스트로 변환해 주세요.",
    "이 음성을 듣고 텍스트 버전을 제공해 주세요.",
    "음성을 텍스트 문서로 변환해 주세요.",
    "음성 내용을 텍스트로 인식하여 변환해 주세요.",
    "음성을 처리하여 텍스트 출력을 제공해 주세요.",
    "음성 대화를 텍스트로 변환해 주세요.",
]

ac_instructions_ko = [
    "이 오디오의 자막을 생성해 주시겠어요?",
    "오디오의 자막을 생성해 주세요.",
    "이 오디오의 자막을 생성해 주세요.",
    "오디오의 자막을 생성해 주세요.",
    "오디오의 자막을 제공해 주세요.",
]

no_punctuation_instructions_ko = [
    "구두점을 없이 생성해 주세요",
    "구두점을 추가하지 마세요",
    "구두점 없이 반환해 주세요",
]

uppercase_instructions_ko = [
    "모든 내용을 대문자로 출력해 주세요",
    "대문자로 된 텍스트를 반환해 주세요",
    "모든 텍스트를 대문자로 만들어 주세요",
    "모두 대문자로 주세요",
]

lowercase_instructions_ko = [
    "모든 내용을 소문자로 출력해 주세요",
    "소문자로 된 텍스트를 반환해 주세요",
]
