asr_instructions_lo = [
    "ກະລຸນາຖາມບົດວາງ.",
    "ທ່ານສາມາດຊ່ວຍການຈຳເລົາຄຳທີ່ກະຊາມມາກັບກັນໄດ້ບໍ?",
    "ທ່ານສາມາດປິດການອອກພາຍໃນບົດວາງຄຳທີ່ກະຊາມມາກັບກັນໄດ້ບໍ?",
    "ກະລຸນາຈຳເລົາບົດວາງຂອງສຽງຫຼືສຽງນັ້ນໃນຮູບແບບຂອງກະຊາມທັງຫມົດ.",
    "ຖາມບົດວາງ.",  ## updated asr prompt1
    "ຈຳເລົາສຽງ.",
    "ກະລຸນາຈຳເລົາສຽງນີ້.",
    "ບັນທຶກຄຳທີ່ສຽງເວົ້າໃນຮູບແບບຂອງກະຊາມ.",
    "ເປີດການຈຳເລົາສຽງນີ້ໃນຮູບແບບກະຊາມ.",
    "ກະລຸນາກັບຄຳທີ່ບົດວາງການສຽງເວົ້າເປັນຮູບແບບຂອງກະຊາມ.",
    "ແປກັບກະຊາມພາຍໃນສຽງນັ້ນ.",
    "ກະລຸນາຊ່ວຍຈຳເລົາຄຳທີ່ສຽງເວົ້າເປັນຮູບແບບຂອງກະຊາມ.",
    "ຟັງສຽງແລະຈຳເລົາໃຫ້ກັບກະຊາມ.",
    "ແປກັບສຽງເປັນກະຊາມທີ່ຈຳເລົາ.",
    "ກະລຸນາຊ່ວຍຈຳເລົາສຽງເວົ້າເປັນກະຊາມ.",
    "ຟັງສຽງແລະຈຳເລົາຂອງສຽງນັ້ນໃຫ້ກັບກະຊາມ.",
    "ປະສົບຄຳທີ່ສຽງແລະຈຳເລົາຂອງສຽງຫຼືທ່ານ.",
]

ac_instructions_lo = [
    "ທ່ານສາມາດສ້າງຄາບຕັບເວົ້າໃຫ້ສຽງຫຼືສຽງນັ້ນບໍ?",
    "ກະລຸນາສ້າງຄາບຕັບເວົ້າສຽງ.",
    "ຂໍການສ້າງຄາບຕັບເວົ້າສຽງ.",
    "ກະລຸນາສ້າງຄາບຕັບເວົ້າສຽງໃຫ້ສຽງ.",
    "ກະລຸນາມອບຄາບຕັບເວົ້າສຽງ.",
]

no_punctuation_instructions_lo = [
    "ສ້າງໂຕອັກສອນໂດຍບໍ່ໃສ່ເຄື່ອງໝາຍວັກຂະນາ",
    "ຢ່າໃສ່ເຄື່ອງໝາຍວັກຂະນາ",
    "ສົ່ງຄືນໂດຍບໍ່ມີເຄື່ອງໝາຍວັກຂະນາ",
]

uppercase_instructions_lo = [
    "ສົ່ງອອກທຸກຢ່າງໃນຕົວພິມໃຫຍ່",
    "ສົ່ງຄືນຂໍ້ຄວາມໃນຕົວພິມໃຫຍ່",
    "ໃຫ້ຂ້ອຍໂຕອັກສອນທັງໝົດໃນຮູບແບບຕົວພິມໃຫຍ່",
    "ຂໍທຸກຢ່າງໃນຮູບແບບຕົວພິມໃຫຍ່ນຳແນ່",
]

lowercase_instructions_lo = [
    "ສົ່ງອອກທຸກຢ່າງໃນຕົວພິມນ້ອຍ",
    "ສົ່ງຄືນຂໍ້ຄວາມໃນຮູບແບບຕົວພິມນ້ອຍ",
]
