asr_instructions_ne = [
    "कृपया ट्रान्सक्राइब गर्नुहोस्।",
    "के तपाईं मलाई भाषणलाई चिन्हित गरेर शब्दकोशमा लेख्न मद्दत गर्न सक्नुहुन्छ?",
    "के तपाईं भाषणलाई टेक्स्ट ट्रान्सक्रिप्टमा रूपान्तरण गर्न सक्नुहुन्छ?",
    "कृपया यस अडियोको सामग्रीलाई टेक्स्ट फारममा ट्रान्सक्राइब गर्नुहोस्।",
    "ट्रान्सक्राइब गर्नुहोस्।",  ## अपडेट गरिएको asr prompt1
    "भाषणलाई ट्रान्सक्राइब गर्नुहोस्।",
    "कृपया यस भाषणलाई ट्रान्सक्राइब गर्नुहोस्।",
    "बोलीको शब्दलाई लेखित रूपमा लेख्नुहोस्।",
    "यस भाषणलाई टेक्स्ट फारममा रूपान्तरण गर्नुहोस्।",
    "बोलीका शब्दलाई लेखित रूपमा ट्रान्सक्राइब गर्नुहोस्।",
    "कृपया मलाई भाषणको लेखित ट्रान्सक्रिप्शन दिनुहोस्।",
    "भाषणलाई टेक्स्ट ट्रान्सक्रिप्शनमा रूपान्तरण गर्नुहोस्।",
    "कृपया मलाई भाषणलाई टेक्स्टमा ट्रान्सक्राइब गर्न मद्दत गर्नुहोस्।",
    "भाषणलाई सुन्नुहोस् र त्यसको टेक्स्ट संस्करण प्रदान गर्नुहोस्।",
    "भाषणलाई टेक्स्ट डोक्युमेन्टको रूपमा ट्रान्सक्राइब गर्नुहोस्।",
    "भाषणमा बोलीएको सामग्रीलाई चिन्हित गर्नुहोस् र त्यसलाई टेक्स्टमा ट्रान्सक्राइब गर्नुहोस्।",
    "भाषणलाई प्रक्रिया गर्नुहोस् र टेक्स्ट उत्पादन प्रदान गर्नुहोस्।",
    "बोली भएको संवादलाई लेखित टेक्स्टमा ट्रान्सक्राइब गर्नुहोस्।",
]

ac_instructions_ne = [
    "के तपाईं अडियोको लागि क्याप्शनहरू सिर्जना गर्न सक्नुहुन्छ?",
    "कृपया अडियोको लागि क्याप्शनहरू सिर्जना गर्नुहोस्।",
    "म तपाईंलाई अडियोको क्याप्शनहरू सिर्जना गर्न अनुरोध गर्दछु।",
    "कृपया अडियोको क्याप्शनहरू सिर्जना गर्नुहोस्।",
    "कृपया अडियोको क्याप्शनहरू प्रदान गर्नुहोस्।",
]


no_punctuation_instructions_ne = [
    "विनासङ्केत उत्पन्न गर्नुहोस्",
    "सङ्केत नथप्नुहोस्",
    "सङ्केतबिना फर्काउनुहोस्",
]

uppercase_instructions_ne = [
    "सबै अक्षर ठूलो अक्षरमा निकाल्नुहोस्",
    "ठूलो अक्षरमा पाठ फर्काउनुहोस्",
    "सबै पाठलाई ठूलो अक्षर बनाउनुहोस्",
    "कृपया सबै कुराहरू क्याप्समा दिनुहोस्",
]

lowercase_instructions_ne = [
    "सबै अक्षर सानो अक्षरमा निकाल्नुहोस्",
    "सानो अक्षरमा पाठ फर्काउनुहोस्",
]
