asr_instructions_ta = [
    "தயவுசெய்து மொழிபெயர்க்கவும்.",
    "நீங்கள் பேச்சை உணர்ந்து அதைப் பதிலாக எழுத்தாக மாற்ற உதவ முடியுமா?",
    "இந்த பேச்சை எழுத்துப் பதிப்பாக மாற்ற முடியுமா?",
    "இந்த ஒலியின் உள்ளடக்கத்தை எழுத்தாக்கமாக மாற்றவும்.",
    "மொழிபெயர்க்கவும்.",  ## updated asr prompt1
    "இந்த பேச்சை எழுத்தாக்கமாக மாற்றவும்.",
    "தயவுசெய்து இந்த பேச்சை மொழிபெயர்க்கவும்.",
    "பேசப்பட்ட வார்த்தைகளை எழுத்து வடிவில் பதிவு செய்யவும்.",
    "இந்த பேச்சை எழுத்து வடிவில் மாற்றவும்.",
    "பேசப்பட்ட வார்த்தைகளை எழுத்து வடிவில் மாற்றவும்.",
    "பேச்சின் உள்ளடக்கத்தை எழுத்து வடிவில் கொடுக்கவும்.",
    "இந்த பேச்சை எழுத்து வடிவில் மாற்றவும்.",
    "தயவுசெய்து இந்த பேச்சை எழுத்து வடிவில் மொழிபெயர்க்க உதவவும்.",
    "இந்த பேச்சைக் கேட்டு அதன் எழுத்து பதிப்பை வழங்கவும்.",
    "இந்த பேச்சை எழுத்து ஆவணமாக மாற்றவும்.",
    "பேச்சில் உள்ள வாய்மொழி உள்ளடக்கத்தை உணர்ந்து எழுத்தாக்கவும்.",
    "பேச்சை செயலாக்கி எழுத்து வெளியீட்டை வழங்கவும்.",
    "பேசப்பட்ட உரையாடலை எழுத்து வடிவில் மாற்றவும்.",
]

ac_instructions_ta = [
    "இந்த ஆடியோகிற்கான வசனங்களை உருவாக்க முடியுமா?",
    "தயவுசெய்து இந்த ஆடியோகிற்கான வசனங்களை உருவாக்குங்கள்.",
    "இந்த ஆடியோகிற்கான வசனங்களை உருவாக்குமாறு நான் கேட்டுக்கொள்கிறேன்.",
    "தயைகூர்ந்து இந்த ஆடியோகிற்கான வசனங்களை உருவாக்குங்கள்.",
    "இந்த ஆடியோகிற்கான வசனங்களை வழங்கவும்.",
]

no_punctuation_instructions_ta = [
    "உரையை குறி எழுத்துகள் இல்லாமல் உருவாக்கு",
    "குறி எழுத்துகள் சேர்க்க வேண்டாம்",
    "குறி எழுத்துகள் இல்லாமல் தரவும்",
]

uppercase_instructions_ta = [
    "எல்லாவற்றையும் பெரிய எழுத்துக்களில் வழங்கவும்",
    "உரையை பெரிய எழுத்துக்களில் திருப்பவும்",
    "எல்லா எழுத்துக்களையும் பெரியதாக்கவும்",
    "எனக்கு எல்லாவற்றையும் பெரிய எழுத்துக்களில் கொடு",
]

lowercase_instructions_ta = [
    "எல்லாவற்றையும் சின்ன எழுத்துக்களில் வழங்கவும்",
    "உரையை சின்ன எழுத்துக்களில் திருப்பவும்",
]
