asr_instructions_th = [
    "โปรดถอดความ.",
    "คุณช่วยรับรู้เสียงและถอดความเป็นคำพูดทีละคำได้ไหม?",
    "คุณสามารถแปลงเสียงเป็นข้อความให้ฉันได้ไหม?",
    "โปรดถอดความเนื้อหาของเสียงนี้เป็นรูปแบบข้อความ.",
    "ถอดความ.",  ## updated asr prompt1
    "ถอดความเสียง.",
    "โปรดถอดความเสียงนี้.",
    "บันทึกคำพูดในรูปแบบข้อความ.",
    "แปลงเสียงนี้เป็นรูปแบบข้อความ.",
    "ถอดความคำพูดเป็นรูปแบบลายลักษณ์อักษร.",
    "โปรดให้การถอดความลายลักษณ์อักษรของเนื้อหาการพูด.",
    "แปลงเสียงเป็นการถอดความข้อความ.",
    "โปรดช่วยถอดความเสียงเป็นข้อความ.",
    "ฟังเสียงและให้เวอร์ชันข้อความ.",
    "แปลงเสียงเป็นเอกสารข้อความเป็นการถอดความ.",
    "รับรู้เนื้อหาทางวาจาในเสียงและถอดความเป็นข้อความ.",
    "ประมวลผลเสียงและให้ผลลัพธ์เป็นข้อความ.",
    "ถอดความการสนทนาทางเสียงเป็นข้อความลายลักษณ์อักษร.",
]

ac_instructions_th = [
    "คุณสามารถสร้างคำบรรยายสำหรับเสียงได้ไหม?",
    "กรุณาสร้างคำบรรยายสำหรับเสียง.",
    "ขอให้คุณสร้างคำบรรยายสำหรับเสียง.",
    "กรุณาสร้างคำบรรยายสำหรับเสียง.",
    "โปรดให้คำบรรยายสำหรับเสียง.",
]

no_punctuation_instructions_th = [
    "สร้างโดยไม่ใส่วรรคตอน",
    "อย่าใส่วรรคตอน",
    "ส่งคืนโดยไม่มีวรรคตอน",
]

uppercase_instructions_th = [
    "แสดงผลทุกอย่างเป็นตัวพิมพ์ใหญ่",
    "ส่งคืนข้อความเป็นตัวพิมพ์ใหญ่ทั้งหมด",
    "ทำให้ข้อความทั้งหมดเป็นตัวพิมพ์ใหญ่",
    "ขอเป็นตัวพิมพ์ใหญ่ทั้งหมดนะ",
]

lowercase_instructions_th = [
    "แสดงผลทุกอย่างเป็นตัวพิมพ์เล็ก",
    "ส่งคืนข้อความเป็นตัวพิมพ์เล็ก",
]
